tests/Mock/HppCompleteAuthorizeSuccess.txt

HTTP/1.1 200 OK
Server: nginx/1.10.0 (Ubuntu)
Date: Fri, 27 Oct 2017 12:40:55 GMT
Content-Type: application/json;charset=utf-8
Content-Length: 1535
Connection: keep-alive
X-XSS-Protection: 1
X-Content-Type-Options: nosniff

{
    "jsonrpc": "2.0",
    "result": {
        "transaction_id": "tra_6975671a2b81a3fb0d385486c994",
        "merchant_id": 1234,
        "merchant_reference": "123456",
        "customer": {
            "customer_id": "cus_387c905096dcf941a259c9e45a98",
            "full_name": "Philippe Gerber"
        },
        "description": "Test booking",
        "metadata": {},
        "attributes": {},
        "funding_instrument_mask": "XXXX XXXX XXXX 4242",
        "status": "authorized",
        "currency": "EUR",
        "authorized_amount": 20000,
        "authorized_amount_formatted": "\u20ac200.00",
        "captured_amount": null,
        "captured_amount_formatted": null,
        "refunded_amount": null,
        "refunded_amount_formatted": null,
        "funding_instrument_issuer_country": null,
        "balance": 20000,
        "balance_formatted": "\u20ac200.00",
        "created_at": "2017-10-27T12:39:17+0000",
        "updated_at": "2017-10-27T12:39:18+0000",
        "value_date": "2017-10-27",
        "was_3ds_used": null,
        "payment_split": [],
        "refunds": [],
        "disputes": [],
        "managed_transactions": [],
        "managing_transaction": null,
        "charge_balance": 20000,
        "charge_currency": "EUR",
        "charge_balance_formatted": "\u20ac200.00"
    },
    "id": 1
}